app/views/prototypes/_prototype.html.haml

      %ul.proto-tag-list--list-inline
        -prototype.tags.each do|tag|
---
SELECT `tags`.* FROM `tags` INNER JOIN `tagmanages` ON `tags`.`id` = `tagmanages`.`tag_id` WHERE `tagmanages`.`prototype_id` = 1