app/controllers/tags_controller.rb

  def show
    @prototypes = @tag.prototypes
    @Tags = Tag.where(name: @tag.name)
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`name` = '7'

  def set_tag
    @tag = Tag.find(params[:id])
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 5 LIMIT 1